## Terraform Enforcement Summary (github)
#### Terraform Format and Style: 🖌`success`
#### Terraform Initialization: ⚙️`success`
#### Terraform Validation: 🤖`success`
#### Terraform Plan: 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
github_membership.owner["IMax153"]: Refreshing state... [id=effect-ts:IMax153]
github_membership.owner["gcanti"]: Refreshing state... [id=effect-ts:gcanti]
github_membership.member["patroza"]: Refreshing state... [id=effect-ts:patroza]
github_membership.owner["mikearnaldi"]: Refreshing state... [id=effect-ts:mikearnaldi]
github_membership.member["pigoz"]: Refreshing state... [id=effect-ts:pigoz]
github_membership.member["sledorze"]: Refreshing state... [id=effect-ts:sledorze]
github_membership.owner["mirepri"]: Refreshing state... [id=Effect-TS:mirepri]
github_membership.owner["schickling"]: Refreshing state... [id=effect-ts:schickling]
github_membership.owner["effect-bot"]: Refreshing state... [id=Effect-TS:effect-bot]
github_membership.member["r-cyr"]: Refreshing state... [id=effect-ts:r-cyr]
github_membership.member["tim-smart"]: Refreshing state... [id=effect-ts:tim-smart]
github_membership.member["0x706b"]: Refreshing state... [id=effect-ts:0x706b]
github_membership.member["mattiamanzati"]: Refreshing state... [id=effect-ts:mattiamanzati]
github_membership.member["qlonik"]: Refreshing state... [id=effect-ts:qlonik]
github_membership.member["steida"]: Refreshing state... [id=Effect-TS:steida]
github_membership.member["aniravi24"]: Refreshing state... [id=Effect-TS:aniravi24]
github_membership.member["tstelzer"]: Refreshing state... [id=effect-ts:tstelzer]
github_membership.member["wesselvdv"]: Refreshing state... [id=effect-ts:wesselvdv]
github_actions_organization_permissions.effect_ts: Refreshing state... [id=effect-ts]
github_repository_webhook.discord["query"]: Refreshing state... [id=276301155]
github_repository_webhook.discord["scala-playground"]: Refreshing state... [id=408369544]
github_repository_webhook.discord["infra"]: Refreshing state... [id=411554932]
github_repository_webhook.discord["stm"]: Refreshing state... [id=408369516]
github_repository_webhook.discord["misc"]: Refreshing state... [id=408369515]
github_repository_webhook.discord["test"]: Refreshing state... [id=408369609]
github_repository_webhook.discord["match"]: Refreshing state... [id=408369597]
github_repository_webhook.discord["remix-plugin"]: Refreshing state... [id=408369584]
github_repository_webhook.discord["babel-plugin"]: Refreshing state... [id=408369605]
github_repository_webhook.discord["typeclass"]: Refreshing state... [id=421660319]
github_repository_webhook.discord["build-utils"]: Refreshing state... [id=420771365]
github_repository_webhook.discord["stream"]: Refreshing state... [id=408369575]
github_repository_webhook.discord["schema"]: Refreshing state... [id=408369519]
github_repository_webhook.discord["printer"]: Refreshing state... [id=287965813]
github_repository_webhook.discord["cli"]: Refreshing state... [id=408369518]
github_repository_webhook.discord["platform"]: Refreshing state... [id=408369606]
github_repository_webhook.discord["effect"]: Refreshing state... [id=274070787]
github_repository_webhook.discord["discord-bot"]: Refreshing state... [id=414268462]
github_repository_webhook.discord["node"]: Refreshing state... [id=276546574]
github_repository_webhook.discord["language-service"]: Refreshing state... [id=408369601]
github_repository_webhook.discord["data"]: Refreshing state... [id=408369535]
github_repository_webhook.discord["eslint-plugin"]: Refreshing state... [id=408369602]
github_repository_webhook.discord["sqlite"]: Refreshing state... [id=408369563]
github_repository_webhook.discord["website"]: Refreshing state... [id=308394217]
github_repository_webhook.discord["rpc"]: Refreshing state... [id=408369524]
github_repository_webhook.discord["cache"]: Refreshing state... [id=408369591]
github_repository_webhook.discord["fastify"]: Refreshing state... [id=408369617]
github_repository_webhook.discord["docgen"]: Refreshing state... [id=416482119]
github_repository_webhook.discord["opentelemetry"]: Refreshing state... [id=408369533]
github_repository_webhook.discord["html"]: Refreshing state... [id=408369536]
github_repository_webhook.discord["vite-plugin"]: Refreshing state... [id=408369517]
github_repository_webhook.discord["io"]: Refreshing state... [id=408369592]
github_repository_webhook.discord["dtslint"]: Refreshing state... [id=416482117]
github_repository_webhook.discord["examples"]: Refreshing state... [id=408369557]
github_app_installation_repositories.changeset-bot: Refreshing state... [id=35785996]
github_repository.repository["docs-ai"]: Refreshing state... [id=docs-ai]
github_repository.repository["platform"]: Refreshing state... [id=platform]
github_repository.repository["query"]: Refreshing state... [id=query]
github_repository.repository["effect"]: Refreshing state... [id=effect]
github_repository.repository["babel-plugin"]: Refreshing state... [id=babel-plugin]
github_repository.repository["stream"]: Refreshing state... [id=stream]
github_repository.repository["data"]: Refreshing state... [id=data]
github_repository.repository["eslint-plugin"]: Refreshing state... [id=eslint-plugin]
github_repository.repository["rpc"]: Refreshing state... [id=rpc]
github_repository.repository["cli"]: Refreshing state... [id=cli]
github_repository.repository["build-utils"]: Refreshing state... [id=build-utils]
github_repository.repository["examples"]: Refreshing state... [id=examples]
github_repository.repository["vite-plugin"]: Refreshing state... [id=vite-plugin]
github_repository.repository["stm"]: Refreshing state... [id=stm]
github_repository.repository["scala-playground"]: Refreshing state... [id=scala-playground]
github_repository.repository["match"]: Refreshing state... [id=match]
github_repository.repository["misc"]: Refreshing state... [id=misc]
github_repository.repository["dtslint"]: Refreshing state... [id=dtslint]
github_repository.repository["docgen"]: Refreshing state... [id=docgen]
github_repository.repository["test"]: Refreshing state... [id=test]
github_repository.repository["typeclass"]: Refreshing state... [id=typeclass]
github_repository.repository["remix-plugin"]: Refreshing state... [id=remix-plugin]
github_repository.repository["schema"]: Refreshing state... [id=schema]
github_repository.repository["html"]: Refreshing state... [id=html]
github_repository.repository["printer"]: Refreshing state... [id=printer]
github_repository.repository["discord-bot"]: Refreshing state... [id=discord-bot]
github_repository.repository["fastify"]: Refreshing state... [id=fastify]
github_repository.repository["website"]: Refreshing state... [id=website]
github_repository.repository["infra"]: Refreshing state... [id=infra]
github_organization_settings.effect_ts: Refreshing state... [id=77678942]
github_repository.repository["io"]: Refreshing state... [id=io]
github_repository.repository["opentelemetry"]: Refreshing state... [id=opentelemetry]
github_repository.repository["sqlite"]: Refreshing state... [id=sqlite]
github_repository.repository["cache"]: Refreshing state... [id=cache]
github_repository.repository["language-service"]: Refreshing state... [id=language-service]
github_repository.repository["node"]: Refreshing state... [id=node]
github_branch_protection.main["dtslint"]: Refreshing state... [id=BPR_kwDOJna5_84CQGyc]
github_branch_protection.main["stm"]: Refreshing state... [id=BPR_kwDOIhjYRs4B4CaC]
github_branch_protection.main["typeclass"]: Refreshing state... [id=BPR_kwDOJ0FOXc4CUlY-]
github_branch_protection.main["docgen"]: Refreshing state... [id=BPR_kwDOJna5984CQGyd]
github_branch_protection.main["website"]: Refreshing state... [id=BPR_kwDOFakh584CBtty]
github_branch_protection.main["vite-plugin"]: Refreshing state... [id=BPR_kwDOIpHjB84B7ayp]
github_repository_collaborators.collaborators["io"]: Refreshing state... [id=io]
github_repository_collaborators.collaborators["vite-plugin"]: Refreshing state... [id=vite-plugin]
github_branch_protection.main["query"]: Refreshing state... [id=BPR_kwDOE4Jfa84CAXRR]
github_branch_protection.main["build-utils"]: Refreshing state... [id=BPR_kwDOJt_STs4CTySq]
github_repository_collaborators.collaborators["rpc"]: Refreshing state... [id=rpc]
github_repository_collaborators.collaborators["misc"]: Refreshing state... [id=misc]
github_repository_collaborators.collaborators["html"]: Refreshing state... [id=html]
github_repository_collaborators.collaborators["cli"]: Refreshing state... [id=cli]
github_repository_collaborators.collaborators["match"]: Refreshing state... [id=match]
github_repository_collaborators.collaborators["babel-plugin"]: Refreshing state... [id=babel-plugin]
github_repository_collaborators.collaborators["eslint-plugin"]: Refreshing state... [id=eslint-plugin]
github_repository_collaborators.collaborators["website"]: Refreshing state... [id=website]
github_repository_collaborators.collaborators["docs-ai"]: Refreshing state... [id=docs-ai]
github_repository_collaborators.collaborators["remix-plugin"]: Refreshing state... [id=remix-plugin]
github_repository_collaborators.collaborators["stream"]: Refreshing state... [id=stream]
github_branch_protection.main["babel-plugin"]: Refreshing state... [id=BPR_kwDOIRGSN84CASZX]
github_repository_collaborators.collaborators["opentelemetry"]: Refreshing state... [id=opentelemetry]
github_repository_collaborators.collaborators["stm"]: Refreshing state... [id=stm]
github_branch_protection.main["eslint-plugin"]: Refreshing state... [id=BPR_kwDOIl_ml84B5sRj]
github_branch_protection.main["test"]: Refreshing state... [id=BPR_kwDOIuK6z84B9dhj]
github_repository_collaborators.collaborators["sqlite"]: Refreshing state... [id=sqlite]
github_branch_protection.main["language-service"]: Refreshing state... [id=BPR_kwDOIVYpPM4B2_af]
github_repository_collaborators.collaborators["discord-bot"]: Refreshing state... [id=discord-bot]
github_repository_collaborators.collaborators["query"]: Refreshing state... [id=query]
github_branch_protection.main["opentelemetry"]: Refreshing state... [id=BPR_kwDOJDKLZM4CEm8A]
github_branch_protection.main["match"]: Refreshing state... [id=BPR_kwDOI3PhuM4CCmMQ]
github_repository_collaborators.collaborators["language-service"]: Refreshing state... [id=language-service]
github_branch_protection.main["data"]: Refreshing state... [id=BPR_kwDOILvjzs4B0Bdw]
github_repository_collaborators.collaborators["typeclass"]: Refreshing state... [id=typeclass]
github_branch_protection.main["sqlite"]: Refreshing state... [id=BPR_kwDOIVRILc4CKLCZ]
github_repository_collaborators.collaborators["node"]: Refreshing state... [id=node]
github_branch_protection.main["html"]: Refreshing state... [id=BPR_kwDOHkUXL84CKLCc]
github_repository_collaborators.collaborators["data"]: Refreshing state... [id=data]
github_branch_protection.main["platform"]: Refreshing state... [id=BPR_kwDOJJLFUs4CGvjL]
github_repository_collaborators.collaborators["fastify"]: Refreshing state... [id=fastify]
github_branch_protection.main["stream"]: Refreshing state... [id=BPR_kwDOIhlXv84B9Tvs]
github_repository_collaborators.collaborators["infra"]: Refreshing state... [id=infra]
github_branch_protection.main["rpc"]: Refreshing state... [id=BPR_kwDOIufVvs4CKLCn]
github_branch_protection.main["effect"]: Refreshing state... [id=BPR_kwDODTMu2M4CKLCk]
github_branch_protection.main["fastify"]: Refreshing state... [id=BPR_kwDOHlLC0M4CKLCY]
github_branch_protection.main["infra"]: Refreshing state... [id=BPR_kwDOI8tVi84CMnGU]
github_branch_protection.main["remix-plugin"]: Refreshing state... [id=BPR_kwDOImwjAc4B57vm]
github_branch_protection.main["scala-playground"]: Refreshing state... [id=BPR_kwDOI_LjYs4CKLCe]
github_branch_protection.main["misc"]: Refreshing state... [id=BPR_kwDOIWbMj84CKLCh]
github_branch_protection.main["examples"]: Refreshing state... [id=BPR_kwDOIf7N2s4CKLCg]
github_branch_protection.main["schema"]: Refreshing state... [id=BPR_kwDOIXtsZ84B2sc2]
github_branch_protection.main["io"]: Refreshing state... [id=BPR_kwDOITjCX84CI0T_]
github_branch_protection.main["cache"]: Refreshing state... [id=BPR_kwDOGjoBYM4CA5hi]
github_branch_protection.main["discord-bot"]: Refreshing state... [id=BPR_kwDOJbFiIc4COq7l]
github_branch_protection.main["node"]: Refreshing state... [id=BPR_kwDOE8DoWc4CKLCi]
github_branch_protection.main["cli"]: Refreshing state... [id=BPR_kwDOGD6DSs4CHrjM]
github_repository_collaborators.collaborators["effect"]: Refreshing state... [id=effect]
github_repository_collaborators.collaborators["docgen"]: Refreshing state... [id=docgen]
github_repository_collaborators.collaborators["cache"]: Refreshing state... [id=cache]
github_repository_collaborators.collaborators["scala-playground"]: Refreshing state... [id=scala-playground]
github_repository_collaborators.collaborators["platform"]: Refreshing state... [id=platform]
github_repository_collaborators.collaborators["printer"]: Refreshing state... [id=printer]
github_repository_collaborators.collaborators["build-utils"]: Refreshing state... [id=build-utils]
github_repository_collaborators.collaborators["dtslint"]: Refreshing state... [id=dtslint]
github_repository_collaborators.collaborators["examples"]: Refreshing state... [id=examples]
github_branch.main["opentelemetry"]: Refreshing state... [id=opentelemetry:main]
github_branch.main["infra"]: Refreshing state... [id=infra:main]
github_branch.main["match"]: Refreshing state... [id=match:main]
github_branch.main["babel-plugin"]: Refreshing state... [id=babel-plugin:main]
github_branch.main["cli"]: Refreshing state... [id=cli:main]
github_branch.main["eslint-plugin"]: Refreshing state... [id=eslint-plugin:main]
github_branch.main["fastify"]: Refreshing state... [id=fastify:main]
github_branch.main["stream"]: Refreshing state... [id=stream:main]
github_branch.main["remix-plugin"]: Refreshing state... [id=remix-plugin:main]
github_branch.main["discord-bot"]: Refreshing state... [id=discord-bot:main]
github_branch.main["dtslint"]: Refreshing state... [id=dtslint:main]
github_branch.main["stm"]: Refreshing state... [id=stm:main]
github_branch.main["data"]: Refreshing state... [id=data:main]
github_branch.main["examples"]: Refreshing state... [id=examples:main]
github_branch.main["website"]: Refreshing state... [id=website:main]
github_branch.main["rpc"]: Refreshing state... [id=rpc:main]
github_branch.main["cache"]: Refreshing state... [id=cache:main]
github_branch.main["effect"]: Refreshing state... [id=effect:main]
github_branch.main["html"]: Refreshing state... [id=html:main]
github_branch.main["schema"]: Refreshing state... [id=schema:main]
github_branch.main["scala-playground"]: Refreshing state... [id=scala-playground:main]
github_branch.main["io"]: Refreshing state... [id=io:main]
github_branch.main["printer"]: Refreshing state... [id=printer:main]
github_branch.main["vite-plugin"]: Refreshing state... [id=vite-plugin:main]
github_branch.main["docgen"]: Refreshing state... [id=docgen:main]
github_branch.main["language-service"]: Refreshing state... [id=language-service:main]
github_branch.main["build-utils"]: Refreshing state... [id=build-utils:main]
github_branch.main["node"]: Refreshing state... [id=node:main]
github_branch.main["sqlite"]: Refreshing state... [id=sqlite:main]
github_branch.main["docs-ai"]: Refreshing state... [id=docs-ai:main]
github_branch.main["platform"]: Refreshing state... [id=platform:main]
github_branch.main["misc"]: Refreshing state... [id=misc:main]
github_branch.main["typeclass"]: Refreshing state... [id=typeclass:main]
github_branch.main["test"]: Refreshing state... [id=test:main]
github_branch_default.main["infra"]: Refreshing state... [id=infra]
github_branch.main["query"]: Refreshing state... [id=query:main]
github_repository_collaborators.collaborators["schema"]: Refreshing state... [id=schema]
github_branch_default.main["examples"]: Refreshing state... [id=examples]
github_branch_default.main["build-utils"]: Refreshing state... [id=build-utils]
github_branch_default.main["printer"]: Refreshing state... [id=printer]
github_branch_default.main["data"]: Refreshing state... [id=data]
github_branch_default.main["discord-bot"]: Refreshing state... [id=discord-bot]
github_branch_default.main["docgen"]: Refreshing state... [id=docgen]
github_branch_default.main["dtslint"]: Refreshing state... [id=dtslint]
github_branch_default.main["query"]: Refreshing state... [id=query]
github_branch_default.main["eslint-plugin"]: Refreshing state... [id=eslint-plugin]
github_repository_collaborators.collaborators["test"]: Refreshing state... [id=test]
github_branch_default.main["effect"]: Refreshing state... [id=effect]
github_branch_default.main["language-service"]: Refreshing state... [id=language-service]
github_branch_default.main["stm"]: Refreshing state... [id=stm]
github_branch_default.main["opentelemetry"]: Refreshing state... [id=opentelemetry]
github_branch_default.main["vite-plugin"]: Refreshing state... [id=vite-plugin]
github_branch_default.main["typeclass"]: Refreshing state... [id=typeclass]
github_branch_default.main["scala-playground"]: Refreshing state... [id=scala-playground]
github_branch_default.main["cli"]: Refreshing state... [id=cli]
github_branch_default.main["rpc"]: Refreshing state... [id=rpc]
github_branch_default.main["stream"]: Refreshing state... [id=stream]
github_branch_default.main["node"]: Refreshing state... [id=node]
github_branch_default.main["sqlite"]: Refreshing state... [id=sqlite]
github_branch_default.main["docs-ai"]: Refreshing state... [id=docs-ai]
github_branch_default.main["misc"]: Refreshing state... [id=misc]
github_branch_default.main["io"]: Refreshing state... [id=io]
github_branch_default.main["website"]: Refreshing state... [id=website]
github_branch_default.main["cache"]: Refreshing state... [id=cache]
github_branch_default.main["schema"]: Refreshing state... [id=schema]
github_branch_default.main["fastify"]: Refreshing state... [id=fastify]
github_branch_default.main["match"]: Refreshing state... [id=match]
github_branch_default.main["platform"]: Refreshing state... [id=platform]
github_branch_default.main["remix-plugin"]: Refreshing state... [id=remix-plugin]
github_branch_default.main["html"]: Refreshing state... [id=html]
github_branch_default.main["test"]: Refreshing state... [id=test]
github_branch_default.main["babel-plugin"]: Refreshing state... [id=babel-plugin]
github_branch_protection.main["printer"]: Refreshing state... [id=BPR_kwDOFNoETc4B3LW1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # github_app_installation_repositories.changeset-bot will be updated in-place
  ~ resource "github_app_installation_repositories" "changeset-bot" {
        id                    = "35785996"
      ~ selected_repositories = [
          + "fastify",
          + "html",
          + "misc",
          + "node",
          + "query",
          + "remix-plugin",
          + "sqlite",
          + "vite-plugin",
            # (23 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # github_branch_protection.main["fastify"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOHlLC0A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["html"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOHkUXLw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["misc"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOIWbMjw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["node"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkzMzE0MDk0OTc="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["query"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "MDEwOlJlcG9zaXRvcnkzMjczMTEyMTE="
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["remix-plugin"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOImwjAQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["sqlite"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOIVRILQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.main["vite-plugin"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOIpHjBw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repository["data"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ archived                    = true -> false
        id                          = "data"
        name                        = "data"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repository["fastify"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "fastify"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "fastify"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (28 unchanged attributes hidden)
    }

  # github_repository.repository["html"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "html"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "html"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repository["io"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ archived                    = true -> false
        id                          = "io"
        name                        = "io"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repository["misc"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "misc"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "misc"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repository["node"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "node"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "node"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (28 unchanged attributes hidden)
    }

  # github_repository.repository["query"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "query"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "query"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repository["remix-plugin"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "remix-plugin"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "remix-plugin"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repository["sqlite"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "sqlite"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "sqlite"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (26 unchanged attributes hidden)
    }

  # github_repository.repository["stm"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ archived                    = true -> false
        id                          = "stm"
        name                        = "stm"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repository["stream"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ archived                    = true -> false
        id                          = "stream"
        name                        = "stream"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.repository["vite-plugin"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "vite-plugin"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "vite-plugin"
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
        # (27 unchanged attributes hidden)
    }

  # github_repository_collaborators.collaborators["website"] will be updated in-place
  ~ resource "github_repository_collaborators" "collaborators" {
        id             = "website"
      ~ invitation_ids = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - user {
          - permission = "push" -> null
          - username   = "lukaswiesehan" -> null
        }
      + user {
          + permission = "push"
          + username   = "wpoosanguansit"
        }
    }

  # github_repository_webhook.discord["babel-plugin"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369605"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["build-utils"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "420771365"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["cache"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369591"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["cli"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369518"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["data"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369535"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["discord-bot"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "414268462"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["docgen"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "416482119"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["dtslint"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "416482117"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["effect"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "274070787"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["eslint-plugin"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369602"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["examples"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369557"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["fastify"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "fastify"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["html"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "html"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["infra"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "411554932"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["io"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369592"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["language-service"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369601"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["match"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369597"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["misc"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "misc"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["node"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "node"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["opentelemetry"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369533"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["platform"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369606"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["printer"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "287965813"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["query"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "query"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["remix-plugin"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "remix-plugin"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["rpc"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369524"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["scala-playground"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369544"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["schema"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369519"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["sqlite"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "sqlite"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["stm"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369516"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["stream"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369575"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["test"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "408369609"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["typeclass"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "421660319"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_webhook.discord["vite-plugin"] will be created
  + resource "github_repository_webhook" "discord" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
      + id         = (known after apply)
      + repository = "vite-plugin"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.discord["website"] will be updated in-place
  ~ resource "github_repository_webhook" "discord" {
      ~ events     = [
          - "*",
          + "fork",
          + "issues",
          + "release",
          + "star",
          + "watch",
        ]
        id         = "308394217"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 16 to add, 40 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @IMax153, Action: `pull_request`, Working Directory: `github`, Workflow: `Terraform Enforcement`*